tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "${FOAM_CASE}/constant/caseSettings"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $:outerInlet.T;

boundaryField
{
    innerInlet
    {
        type            fixedValue;
        value           uniform $:innerInlet.T;
    }

    outerInlet
    {
        type            fixedValue;
        value           uniform $:outerInlet.T;
    }

    outlet      { $:outlet.T; }
    staticWalls { $:wall.T; }
    movingWalls { $staticWalls; }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
